src/Documents/НачисленияСотрудников/НачисленияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачисленияСотрудников</name>
  <registerRecords>CalculationRegister.НачисленияСотрудников</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудники</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/НачисленияСотрудников/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.НачисленияСотрудников.Записывать = Истина;
	Движения.НачисленияСотрудников.Очистить();
	Для Каждого ТекСтрокаНачисления из Начисления Цикл

		Движение = Движения.НачисленияСотрудников.Добавить();
//		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
//		Движение.Сотрудники = ТекСтрокаНачисления.Сотрудники;
//		Движение.Сумма = ТекСтрокаНачисления.Сумма;
//		Движение.Параметр = ТекСтрокаНачисления.Параметр;
	
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаНачисления );
		
	КонецЦикла;

	Дополнения = Движения.НачисленияСотрудников.ПолучитьДополнение();

	Для Каждого Стр Из Дополнения Цикл
		
		Движение = Движения.НачисленияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Стр);
		Движение.ПериодРегистрации = Стр.ПериодРегистрацииСторно;
		Движение.ПериодДействияНачало = Стр.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = Стр.ПериодДействияКонецСторно;
		Движение.Сторно = Истина;
		
	КонецЦикла;

	Движения.Записать();
	Расчеты.РасчитатьПремию(Ссылка);

КонецПроцедуры
